Revit 2024 API
RebarContainer.GetParametersManager Method
 Returns an object used to manage parameters of the Rebar Container.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public RebarContainerParameterManager GetParametersManager()
Visual Basic
Public Function GetParametersManager As RebarContainerParameterManager
Visual C++
public:
RebarContainerParameterManager^ GetParametersManager()
Return Value
 The parameters manager.
See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace